Revit 2027 API
RebarSpliceGeometry Constructor
 Constructs a RebarSpliceGeometry.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarSpliceGeometry(
	XYZ spliceOrigin,
	XYZ spliceNormal
)
Public Sub New (
	spliceOrigin As XYZ,
	spliceNormal As XYZ
)
public:
RebarSpliceGeometry(
	XYZ^ spliceOrigin,
	XYZ^ spliceNormal
)
new :
        spliceOrigin : XYZ *
        spliceNormal : XYZ -> RebarSpliceGeometry
Parameters
spliceOrigin XYZ
 The splice face origin.
spliceNormal XYZ
 The splice face normal.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  spliceNormal has zero length.
See Also
Reference
RebarSpliceGeometry Class
Autodesk.Revit.DB.Structure Namespace